Tekla Open API Reference for Tekla Structures 2025
NumericConstantFilterExpression Constructor (UInt32, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public NumericConstantFilterExpression(
	uint Value,
	IFormatProvider Provider
)
Public Sub New (
	Value As UInteger,
	Provider As IFormatProvider
)
Parameters
Value
Type: System.UInt32
The value to represent.
Provider
Type: System.IFormatProvider
An IFormatProvider object.
See Also
Reference
NumericConstantFilterExpression Class
NumericConstantFilterExpression Overload
Tekla.Structures.Filtering Namespace